[
   {
      "name":"Pizza Margherita",
      "type":"hot",
      "description":"Uma pizza clássica italiana com tomates frescos, queijo muçarela e folhas de manjericão.",
      "image":"pizza_margherita.jpg",
      "ingredients":[
         "300g de farinha de trigo",
         "200ml de água morna",
         "10g de fermento biológico seco",
         "1 colher de chá de sal",
         "1 colher de sopa de azeite",
         "1 Pacote de Extrato de tomate",
         "Azeite de oliva",
         "Sal e pimenta a gosto",
         "Uma pitada de açúcar",
         "200g de queijo muçarela em fatias",
         "Folhas frescas de manjericão"
      ],
      "prepareMode":"Modo de Preparo:\n1. Comece pela massa da pizza, preparando uma massa macia e elástica. Amasse os ingredientes, como farinha de trigo, água, fermento, sal e um toque de azeite. Deixe a massa descansar e crescer por um tempo.\n2. Em seguida, abra a massa em formato circular, usando as mãos ou um rolo de macarrão. A espessura vai depender do seu gosto pessoal, se prefere uma massa fina e crocante ou mais grossa e fofinha.\n3. Prepare o molho de tomate, usando tomates frescos maduros, alho, azeite, sal e uma pitada de açúcar para equilibrar a acidez. Cozinhe os ingredientes em fogo baixo até obter um molho encorpado e saboroso.\n4. Espalhe o molho de tomate sobre a massa, deixando uma borda livre para formar a crosta da pizza.\n5. Cubra a pizza com fatias generosas de queijo muçarela, que irá derreter e criar uma cobertura deliciosa.\n6. Leve a pizza ao forno pré-aquecido em temperatura alta por cerca de 15 minutos, ou até que a massa esteja dourada e o queijo derretido e levemente gratinado.\n7. Retire a pizza do forno e finalize com folhas frescas de manjericão, que trarão um aroma e sabor irresistíveis.\n8. Corte a pizza em fatias e sirva imediatamente, apreciando cada mordida dessa combinação clássica de sabores.",
      "timingToCook":"30 minutos",
      "prepareLevel":"Fácil"
   },
   {
      "name":"Macarrão à Bolonhesa",
      "type":"hot",
      "description":"Um prato tradicional de massa italiana com um rico molho de carne feito com carne moída, tomates e ervas.",
      "image":"spaghetti_bolognese.jpg",
      "ingredients":[
               "300g de macarrão",
               "500g de carne moída",
               "1 cebola picada",
               "2 dentes de alho picados",
               "4 tomates picados",
               "1 xícara de molho de tomate",
               "Sal e pimenta a gosto",
               "Orégano e outras ervas a gosto",
               "Queijo parmesão ralado",
               "Folhas de manjericão fresco"
      ],
      "prepareMode":"Modo de Preparo:\n1. Em uma panela grande, aqueça um pouco de azeite e refogue cebola e alho até ficarem dourados e perfumados.\n2. Adicione a carne moída à panela e cozinhe em fogo médio-alto até que esteja bem dourada e cozida por completo.\n3. Acrescente os tomates picados e o molho de tomate à panela. Tempere com sal, pimenta-do-reino, orégano e outras ervas de sua preferência, como manjericão e tomilho. Misture bem.\n4. Reduza o fogo para médio-baixo e deixe o molho cozinhar lentamente por cerca de 30 minutos, mexendo ocasionalmente para evitar que grude no fundo da panela.\n5. Enquanto o molho cozinha, prepare a massa de macarrão de sua escolha conforme as instruções da embalagem. Cozinhe até ficar al dente, escorra e reserve.\n6. Quando o molho de carne estiver pronto, sirva-o sobre o macarrão cozido. Misture delicadamente para garantir que todos os fios de macarrão fiquem envolvidos pelo molho.\n7. Finalize com queijo parmesão ralado e folhas de manjericão fresco para adicionar mais sabor e frescor ao prato.\n8. Sirva quente e aproveite o delicioso Macarrão à Bolonhesa, um clássico da culinária italiana.",
      "timingToCook":"45 minutos",
      "prepareLevel":"Intermediário"
   },
   {
      "name":"Frango à Parmegiana",
      "type":"hot",
      "description":"Peitos de frango empanados cobertos com molho marinara, queijo muçarela e queijo parmesão, depois assados até ficarem dourados e borbulhantes.",
      "image":"chicken_parmesan.jpg",
      "ingredients":[
               "2 peitos de frango",
               "Farinha de trigo para empanar",
               "2 ovos batidos",
               "Pão ralado para empanar",
               "Azeite de oliva",
               "Sal e pimenta a gosto",
               "Molho marinara",
               "Queijo muçarela ralado",
               "Queijo parmesão ralado",
               "Folhas de manjericão fresco"
      ],
      "prepareMode":"Modo de Preparo:\n1. Preaqueça o forno a 200°C.\n2. Tempere os peitos de frango com sal e pimenta a gosto.\n3. Passe os peitos de frango na farinha de trigo, em seguida nos ovos batidos e por fim no pão ralado, certificando-se de que estejam bem empanados.\n4. Aqueça um pouco de azeite de oliva em uma frigideira e frite os peitos de frango empanados em fogo médio-alto até dourarem dos dois lados.\n5. Em uma assadeira, espalhe uma camada de molho marinara. Coloque os peitos de frango empanados sobre o molho e cubra-os com mais molho.\n6. Polvilhe queijo muçarela ralado e queijo parmesão ralado sobre o frango.\n7. Leve ao forno pré-aquecido por cerca de 20 a 25 minutos, ou até que o queijo esteja derretido e dourado.\n8. Retire do forno e finalize com folhas frescas de manjericão.\n9. Sirva o Frango à Parmegiana quente acompanhado de arroz branco e desfrute dessa deliciosa combinação de sabores.",
      "timingToCook":"50 minutos",
      "prepareLevel":"Intermediário"
   },
   {
      "name":"Chili de Carne",
      "type":"hot",
      "description":"Um chili substancioso e apimentado feito com carne moída, feijão, tomates e uma mistura de especiarias.",
      "image":"beef_chili.jpg",
      "ingredients":[
               "500g de carne moída",
               "2 latas de feijão (preto ou vermelho)",
               "4 tomates picados",
               "1 cebola picada",
               "2 dentes de alho picados",
               "1 pimentão picado",
               "2 colheres de sopa de óleo vegetal",
               "1 colher de sopa de cominho em pó",
               "1 colher de sopa de páprica em pó",
               "1 colher de chá de pimenta em pó",
               "Sal a gosto",
               "Coentro fresco picado para finalizar"
      ],
      "prepareMode":"Modo de Preparo:\n1. Em uma panela grande, aqueça o óleo vegetal em fogo médio.\n2. Adicione a cebola, o alho e o pimentão picados e refogue até ficarem macios e levemente dourados.\n3. Acrescente a carne moída à panela e cozinhe até que esteja bem dourada e cozida por completo.\n4. Adicione os tomates picados, o feijão, o cominho em pó, a páprica em pó, a pimenta em pó e o sal. Misture bem todos os ingredientes.\n5. Reduza o fogo para baixo e deixe o chili cozinhar lentamente por pelo menos 1 hora, mexendo ocasionalmente para os sabores se misturarem e o chili engrossar.\n6. Prove e ajuste o tempero conforme seu gosto pessoal.\n7. Sirva o chili quente, polvilhado com coentro fresco picado por cima.\n8. Acompanhe com arroz branco, nachos, sour cream ou guacamole, se desejar.",
      "timingToCook":"1 hora e 30 minutos",
      "prepareLevel":"Avançado"
   },
   {
      "name":"Bolo de Chocolate com Recheio Cremoso",
      "type":"hot",
      "description":"Um bolo de chocolate decadente com um centro cremoso de chocolate derretido. Servido quente com uma bola de sorvete de baunilha.",
      "image":"chocolate_lava_cake.jpg",
      "ingredients":[
               "100g de chocolate meio amargo",
               "100g de manteiga sem sal",
               "2 ovos",
               "2 gemas",
               "50g de açúcar",
               "30g de farinha de trigo",
               "Bolas de sorvete de baunilha para servir"
      ],
      "prepareMode":"Modo de Preparo:\n1. Preaqueça o forno a 180°C e unte pequenas formas individuais de bolo.\n2. Derreta o chocolate e a manteiga em banho-maria ou no microondas, mexendo bem até obter uma mistura lisa e homogênea.\n3. Em uma tigela, bata os ovos, as gemas e o açúcar até obter uma mistura clara e fofa.\n4. Adicione a mistura de chocolate derretido à tigela dos ovos batidos e misture delicadamente até incorporar bem.\n5. Acrescente a farinha de trigo peneirada à mistura de chocolate e ovos. Misture suavemente até obter uma massa homogênea.\n6. Divida a massa entre as formas individuais de bolo, preenchendo cerca de 2/3 de cada forma.\n7. Leve as formas ao forno pré-aquecido e asse por aproximadamente 12-15 minutos, ou até que as bordas estejam firmes e o centro ainda esteja ligeiramente mole.\n8. Retire os bolos do forno e deixe descansar por alguns minutos antes de desenformar.\n9. Sirva os bolos de chocolate ainda quentes, acompanhados de bolas de sorvete de baunilha.\n10. Aproveite essa deliciosa combinação de bolo de chocolate com recheio cremoso!",
      "timingToCook":"25 minutos",
      "prepareLevel":"Intermediário"
   },
   {
      "name":"Lasanha de Carne",
      "type":"hot",
      "description":"Uma deliciosa lasanha de carne com camadas de macarrão, molho de carne, queijo e molho bechamel.",
      "image":"beef_lasagna.jpg",
      "ingredients":[
               "500g de massa para lasanha",
               "500g de carne moída",
               "1 cebola picada",
               "2 dentes de alho picados",
               "2 latas de tomate pelado",
               "2 colheres de sopa de extrato de tomate",
               "1 colher de chá de açúcar",
               "Sal e pimenta a gosto",
               "300g de queijo muçarela",
               "100g de queijo parmesão ralado",
               "Molho bechamel (branco)"
      ],
      "prepareMode":"Modo de Preparo:\n1. Em uma panela grande, aqueça um pouco de azeite e refogue a cebola e o alho até ficarem dourados e perfumados.\n2. Adicione a carne moída à panela e cozinhe em fogo médio-alto até que esteja bem dourada e cozida por completo.\n3. Acrescente as latas de tomate pelado, o extrato de tomate, o açúcar, o sal e a pimenta. Misture bem todos os ingredientes e deixe o molho cozinhar por cerca de 20 minutos em fogo baixo, mexendo ocasionalmente.\n4. Enquanto isso, cozinhe a massa para lasanha de acordo com as instruções da embalagem. Escorra e reserve.\n5. Em um refratário, faça camadas alternadas de massa, molho de carne, queijo muçarela e molho bechamel. Repita o processo até utilizar todos os ingredientes, terminando com uma camada de queijo muçarela e queijo parmesão ralado por cima.\n6. Leve a lasanha ao forno preaquecido a 180°C e asse por aproximadamente 30-35 minutos, ou até que o queijo esteja derretido e dourado.\n7. Retire do forno e deixe descansar por alguns minutos antes de servir.\n8. Sirva a lasanha de carne quente, acompanhada de uma salada fresca.\n9. Aproveite essa delícia de camadas saborosas e texturas incríveis!",
      "timingToCook":"1 hora e 15 minutos",
      "prepareLevel":"Avançado"
   },
   {
      "name":"Risoto de Cogumelos",
      "type":"hot",
      "description":"Um risoto cremoso e reconfortante preparado com arroz arbóreo, cogumelos frescos, caldo de legumes e queijo parmesão.",
      "image":"mushroom_risotto.jpg",
      "ingredients":[
               "2 xícaras de arroz arbóreo",
               "500g de cogumelos frescos (shiitake, champignon, porcini, etc.)",
               "1 cebola picada",
               "2 dentes de alho picados",
               "4 xícaras de caldo de legumes",
               "1 xícara de vinho branco seco",
               "1/2 xícara de queijo parmesão ralado",
               "3 colheres de sopa de manteiga",
               "Azeite de oliva",
               "Sal e pimenta a gosto",
               "Salsinha picada para decorar"

      ],
      "prepareMode":"Modo de Preparo:\n1. Em uma panela, aqueça um pouco de azeite e refogue a cebola e o alho até ficarem dourados e perfumados.\n2. Adicione os cogumelos fatiados e refogue por alguns minutos, até que estejam macios e dourados. Tempere com sal e pimenta a gosto.\n3. Retire os cogumelos da panela e reserve.\n4. Na mesma panela, adicione um pouco mais de azeite e acrescente o arroz arbóreo. Refogue por alguns minutos, mexendo sempre, até que os grãos estejam envolvidos no azeite e ligeiramente translúcidos.\n5. Adicione o vinho branco e mexa até que seja absorvido pelo arroz.\n6. Aos poucos, adicione o caldo de legumes quente, cerca de 1/2 xícara de cada vez, mexendo constantemente e esperando que o caldo seja absorvido antes de adicionar mais. Continue adicionando caldo e mexendo até que o arroz esteja al dente e cremoso.\n7. Retire a panela do fogo e adicione os cogumelos refogados, o queijo parmesão e a manteiga. Misture bem até que o queijo derreta e o risoto fique cremoso e brilhante.\n8. Ajuste o tempero com sal e pimenta, se necessário.\n9. Sirva o risoto de cogumelos em pratos individuais, decorado com salsinha picada por cima.\n10. Desfrute desse prato reconfortante e cheio de sabor!",
      "timingToCook":"40 minutos",
      "prepareLevel":"Intermediário"
   },
   {
      "name":"Sopa de Tomate",
      "type":"hot",
      "description":"Uma sopa clássica de tomate feita com tomates maduros, cebola, alho e temperos. Perfeita para os dias mais frios.",
      "image":"tomato_soup.jpg",
      "ingredients":[
               "1kg de tomates maduros",
               "1 cebola grande picada",
               "2 dentes de alho picados",
               "2 colheres de sopa de azeite de oliva",
               "4 xícaras de caldo de legumes",
               "1 colher de chá de açúcar",
               "Sal e pimenta a gosto",
               "Folhas de manjericão fresco para decorar"
      ],
      "prepareMode":"Modo de Preparo:\n1. Comece preparando os tomates. Faça um corte em forma de cruz na parte de baixo de cada tomate e mergulhe-os em água fervente por cerca de 1 minuto. Em seguida, coloque-os em água gelada para parar o cozimento. Retire a pele dos tomates e corte-os em pedaços.\n2. Em uma panela grande, aqueça o azeite de oliva em fogo médio. Adicione a cebola picada e o alho e refogue até que fiquem dourados e perfumados.\n3. Adicione os tomates picados à panela e refogue por mais alguns minutos, até que eles comecem a soltar seu suco.\n4. Acrescente o caldo de legumes à panela e deixe a sopa ferver. Reduza o fogo, tampe parcialmente a panela e deixe cozinhar por cerca de 20 minutos, para que os sabores se misturem e os tomates amoleçam.\n5. Use um liquidificador ou um mixer de mão para bater a sopa até obter uma consistência cremosa e homogênea.\n6. Tempere a sopa com sal, pimenta e uma pitada de açúcar para equilibrar a acidez dos tomates. Mexa bem para incorporar os temperos.\n7. Sirva a sopa de tomate quente, decorada com folhas frescas de manjericão.\n8. Aproveite essa sopa reconfortante, perfeita para aquecer nos dias mais frios!",
      "timingToCook":"35 minutos",
      "prepareLevel":"Fácil"
   },
   {
      "name":"Pão de Queijo",
      "type":"hot",
      "description":"Uma delícia brasileira, o pão de queijo é feito com polvilho azedo, queijo minas e ovos, assado até ficar crocante por fora e macio por dentro.",
      "image":"pao_de_queijo.jpg",
      "ingredients":[
               "500g de polvilho azedo",
               "250ml de leite",
               "100ml de óleo vegetal",
               "3 ovos",
               "200g de queijo minas ralado",
               "Sal a gosto"
      ],
      "prepareMode":"Modo de Preparo:\n1. Em uma panela, aqueça o leite e o óleo até ferver.\n2. Em uma tigela grande, coloque o polvilho azedo e despeje a mistura de leite e óleo quente sobre ele. Misture bem até obter uma massa homogênea.\n3. Deixe a massa esfriar um pouco e adicione os ovos um a um, misturando bem após cada adição.\n4. Acrescente o queijo minas ralado e misture até incorporar completamente na massa.\n5. Tempere a massa com sal a gosto e misture novamente.\n6. Pré-aqueça o forno a 180°C.\n7. Modele pequenas bolinhas com a massa e disponha em uma assadeira untada.\n8. Leve ao forno preaquecido e asse por cerca de 25 a 30 minutos, ou até que os pães de queijo estejam dourados e firmes.\n9. Retire do forno e sirva os pães de queijo ainda quentes, aproveitando a crocância por fora e a maciez por dentro.\n10. Desfrute dessa delícia brasileira que é o pão de queijo!",
      "timingToCook":"30 minutos",
      "prepareLevel":"Fácil"
   },
   {
      "name":"Feijoada",
      "type":"hot",
      "description":"O prato nacional do Brasil, a feijoada é um ensopado rico e saboroso feito com feijão preto, carne de porco, linguiça, costelinha e diversos acompanhamentos.",
      "image":"feijoada.jpg",
      "ingredients":[
               "500g de feijão preto",
               "500g de carne de porco (como paio, carne seca, lombo, costelinha)",
               "500g de linguiça calabresa",
               "1 cebola grande picada",
               "4 dentes de alho picados",
               "2 folhas de louro",
               "Sal a gosto",
               "Pimenta a gosto",
               "Cheiro-verde picado (salsinha e cebolinha) para finalizar"
      ],
      "prepareMode":"Modo de Preparo:\n1. Deixe o feijão de molho em água fria por pelo menos 12 horas.\n2. Em uma panela de pressão, cozinhe o feijão em água com as folhas de louro até ficar macio. Escorra a água e reserve o feijão cozido.\n3. Em outra panela, cozinhe as carnes de porco em água até ficarem macias. Escorra a água e reserve as carnes cozidas.\n4. Em uma frigideira, frite a linguiça calabresa em rodelas até ficar dourada. Reserve a linguiça frita.\n5. Em uma panela grande, refogue a cebola e o alho em um pouco de óleo até ficarem dourados.\n6. Adicione o feijão cozido e as carnes reservadas à panela com a cebola e o alho. Tempere com sal e pimenta a gosto.\n7. Deixe a feijoada cozinhar em fogo baixo por aproximadamente 2 horas, mexendo de vez em quando para não grudar no fundo da panela.\n8. Ajuste o tempero se necessário e adicione o cheiro-verde picado para finalizar.\n9. Sirva a feijoada bem quente, acompanhada de arroz branco, couve refogada, laranja fatiada e farofa.\n10. Aproveite essa delícia brasileira, a feijoada!",
      "timingToCook":"3 horas",
      "prepareLevel":"Avançado"
   },
   {
      "name":"Moqueca de Peixe",
      "type":"hot",
      "description":"Um prato típico da culinária brasileira, a moqueca de peixe é um ensopado feito com peixe, leite de coco, dendê, tomate, pimentões e temperos, servido com arroz branco.",
      "image":"moqueca.jpg",
      "ingredients":[
               "800g de filé de peixe (robalo, dourado, badejo)",
               "1 cebola grande cortada em rodelas",
               "2 dentes de alho picados",
               "2 tomates grandes cortados em rodelas",
               "1 pimentão verde cortado em rodelas",
               "1 pimentão vermelho cortado em rodelas",
               "Coentro picado a gosto",
               "Suco de 1 limão",
               "200ml de leite de coco",
               "2 colheres de sopa de azeite de dendê",
               "Sal a gosto",
               "Pimenta a gosto"
      ],
      "prepareMode":"Modo de Preparo:\n1. Tempere os filés de peixe com suco de limão, sal e pimenta. Deixe marinar por cerca de 30 minutos.\n2. Em uma panela grande, aqueça o azeite de dendê e refogue a cebola e o alho até ficarem dourados e perfumados.\n3. Adicione os tomates, os pimentões e o coentro à panela. Refogue por alguns minutos até que os legumes fiquem levemente macios.\n4. Coloque os filés de peixe sobre os legumes na panela. Cubra com o leite de coco e adicione sal e pimenta a gosto.\n5. Tampe a panela e deixe cozinhar em fogo baixo por cerca de 30 minutos, ou até que o peixe esteja cozido e macio.\n6. Sirva a moqueca de peixe bem quente, acompanhada de arroz branco e farofa de dendê.\n7. Aproveite essa delícia da culinária brasileira, a moqueca de peixe!",
      "timingToCook":"1 hora",
      "prepareLevel":"Intermediário"
   },
   {
      "name":"Bobó de Camarão",
      "type":"hot",
      "description":"Um prato tradicional da culinária nordestina brasileira, o bobó de camarão é feito com camarões refogados em um creme de mandioca, leite de coco, dendê e temperos.",
      "image":"bobo_de_camarao.jpg",
      "ingredients":[
               "500g de camarão descascado e limpo",
               "500g de mandioca descascada e picada",
               "400ml de leite de coco",
               "2 colheres de sopa de azeite de dendê",
               "1 cebola picada",
               "3 dentes de alho picados",
               "1 pimentão picado",
               "2 tomates picados",
               "Coentro picado a gosto",
               "Suco de 1 limão",
               "Sal a gosto",
               "Pimenta a gosto"
      ],
      "prepareMode":"Modo de Preparo:\n1. Tempere o camarão com suco de limão, sal e pimenta. Reserve.\n2. Em uma panela grande, cozinhe a mandioca em água fervente até que fique macia e fácil de amassar. Escorra e reserve.\n3. Em uma frigideira ou panela, aqueça o azeite de dendê e refogue a cebola, o alho, o pimentão e os tomates até que fiquem macios.\n4. Adicione o camarão temperado à frigideira e refogue até que fique rosado e cozido.\n5. Em um liquidificador ou processador de alimentos, bata a mandioca cozida com o leite de coco até obter um creme liso e homogêneo.\n6. Despeje o creme de mandioca na frigideira com o camarão e os vegetais. Misture bem e deixe cozinhar por alguns minutos até que o bobó esteja bem quente.\n7. Finalize com coentro picado e ajuste o tempero com sal e pimenta, se necessário.\n8. Sirva o bobó de camarão acompanhado de arroz branco e farofa. Aproveite essa delícia da culinária nordestina brasileira!",
      "timingToCook":"1 hora",
      "prepareLevel":"Intermediário"
   },
   {
      "name":"Bacalhau à Gomes de Sá",
      "type":"hot",
      "description":"Uma receita clássica de bacalhau portuguesa, o bacalhau à Gomes de Sá é feito com bacalhau dessalgado, batatas, cebolas, azeitonas e azeite, assado até ficar dourado.",
      "image":"bacalhau_gomes_de_sa.jpg",
      "ingredients":[
               "500g de bacalhau dessalgado",
               "500g de batatas cortadas em rodelas",
               "2 cebolas cortadas em rodelas",
               "Azeitonas pretas a gosto",
               "Azeite de oliva extra virgem",
               "Salsa picada a gosto",
               "Sal a gosto",
               "Pimenta-do-reino a gosto"
      ],
      "prepareMode":"Modo de Preparo:\n1. Pré-aqueça o forno a 180°C.\n2. Em uma panela grande, cozinhe o bacalhau dessalgado em água fervente por aproximadamente 10 minutos. Escorra e desfie o bacalhau em pedaços grandes, removendo espinhas e peles.\n3. Em outra panela, cozinhe as batatas em água fervente com sal até ficarem macias, mas firmes. Escorra e reserve.\n4. Em uma frigideira grande, aqueça um pouco de azeite de oliva e refogue as cebolas até ficarem macias e levemente douradas.\n5. Em um refratário, coloque uma camada de batatas cozidas no fundo. Por cima, adicione o bacalhau desfiado e as cebolas refogadas.\n6. Regue tudo com bastante azeite de oliva, salpique azeitonas pretas e salsa picada por cima.\n7. Leve ao forno pré-aquecido por aproximadamente 30 minutos, ou até que o bacalhau esteja dourado e as batatas estejam bem cozidas.\n8. Retire do forno e sirva o Bacalhau à Gomes de Sá ainda quente, acompanhado de uma salada verde e pão. Aproveite essa delícia da culinária portuguesa!",
      "timingToCook":"1 hora e 30 minutos",
      "prepareLevel":"Intermediário"
   },
   {
      "name":"Torta de Frango",
      "type":"hot",
      "description":"Uma torta caseira recheada com frango desfiado, legumes, temperos e coberta com uma massa crocante.",
      "image":"chicken_pot_pie.jpg",
      "ingredients":[
               "500g de peito de frango cozido e desfiado",
               "1 cebola picada",
               "2 dentes de alho picados",
               "2 cenouras picadas",
               "1 batata picada",
               "1 xícara de ervilhas",
               "1 xícara de milho",
               "1 xícara de caldo de frango",
               "1/2 xícara de leite",
               "2 colheres de sopa de farinha de trigo",
               "2 colheres de sopa de manteiga",
               "Sal e pimenta a gosto",
               "Massa folhada ou massa de torta pronta"
      ],
      "prepareMode":"Modo de Preparo:\n1. Pré-aqueça o forno a 180°C.\n2. Em uma panela grande, aqueça a manteiga e refogue a cebola e o alho até ficarem dourados.\n3. Adicione a cenoura, a batata, as ervilhas e o milho à panela e refogue por alguns minutos.\n4. Em uma tigela pequena, misture o leite e a farinha de trigo até obter uma mistura homogênea. Reserve.\n5. Acrescente o frango desfiado e o caldo de frango à panela, mexendo bem.\n6. Despeje a mistura de leite e farinha na panela e cozinhe em fogo baixo até engrossar, formando um recheio cremoso. Tempere com sal e pimenta a gosto.\n7. Transfira o recheio para uma forma de torta previamente forrada com a massa folhada ou massa de torta pronta.\n8. Cubra a torta com outra camada de massa folhada ou massa de torta, fechando bem as bordas.\n9. Faça pequenos cortes na superfície da massa para permitir que o vapor saia durante o cozimento.\n10. Leve a torta ao forno pré-aquecido e asse por aproximadamente 30 minutos, ou até que a massa fique dourada e crocante.\n11. Retire a torta do forno e deixe esfriar um pouco antes de servir.\n12. Sirva a Torta de Frango quente e desfrute dessa delícia caseira!",
      "timingToCook":"1 hora",
      "prepareLevel":"Intermediário"
   },
   {
      "name":"Rabanada",
      "type":"hot",
      "description":"Um doce tradicional de Natal, a rabanada é feita com fatias de pão embebidas em uma mistura de leite, ovos e açúcar, fritas até ficarem douradas e polvilhadas com canela.",
      "image":"rabanada.jpg",
      "ingredients":[
               "8 fatias de pão de forma",
               "2 xícaras de leite",
               "3 ovos",
               "3 colheres de sopa de açúcar",
               "1 colher de chá de essência de baunilha",
               "Óleo para fritar",
               "Açúcar e canela para polvilhar"
      ],
      "prepareMode":"Modo de Preparo:\n1. Em uma tigela, misture o leite, os ovos, o açúcar e a essência de baunilha.\n2. Mergulhe as fatias de pão na mistura de leite, certificando-se de que fiquem bem embebidas.\n3. Aqueça o óleo em uma frigideira grande em fogo médio.\n4. Coloque as fatias de pão mergulhadas na frigideira e frite até ficarem douradas e crocantes de ambos os lados.\n5. Retire as rabanadas da frigideira e coloque-as em um prato forrado com papel toalha para absorver o excesso de óleo.\n6. Polvilhe as rabanadas com uma mistura de açúcar e canela, a gosto.\n7. Sirva as rabanadas quentes ou em temperatura ambiente.\n8. Aproveite essa delícia tradicional de Natal!",
      "timingToCook":"30 minutos",
      "prepareLevel":"Fácil"
   },
   {
      "name":"Pudim de Leite Condensado",
      "type":"hot",
      "description":"Um clássico da culinária brasileira, o pudim de leite condensado é uma sobremesa cremosa e irresistível. Feito com poucos ingredientes, é perfeito para encerrar uma refeição com chave de ouro.",
      "image":"pudim.jpg",
      "ingredients":[
         "1 lata de leite condensado",
         "1 lata de leite (a mesma medida do leite condensado)",
         "3 ovos",
         "1 xícara de açúcar (para a calda)"
      ],
      "prepareMode":"Modo de Preparo:\n1. Preaqueça o forno a 180°C.\n2. Em uma panela, derreta o açúcar em fogo baixo, mexendo sempre, até obter um caramelo dourado.\n3. Despeje o caramelo em uma forma de pudim, espalhando bem por toda a superfície e reserve.\n4. No liquidificador, bata o leite condensado, o leite e os ovos até obter uma mistura homogênea.\n5. Despeje a mistura na forma caramelizada.\n6. Cubra a forma com papel-alumínio e leve ao forno em banho-maria por aproximadamente 1 hora.\n7. Para verificar se o pudim está pronto, espete um palito no centro. Se sair limpo, está pronto. Caso contrário, deixe assar por mais alguns minutos.\n8. Retire o pudim do forno e deixe esfriar completamente.\n9. Leve à geladeira por pelo menos 4 horas antes de desenformar.\n10. Para desenformar, passe uma faca ao redor da forma e vire em um prato de servir.\n11. Sirva gelado e aproveite essa delícia!",
      "timingToCook":"1 hora e 30 minutos (incluindo tempo de geladeira)",
      "prepareLevel":"Fácil"
   },
   {
      "name":"Salada de Frutas",
      "type":"hot",
      "description":"Uma opção refrescante e saudável, a salada de frutas é uma combinação colorida e deliciosa de diversas frutas frescas. É uma ótima escolha para os dias quentes ou como uma sobremesa leve.",
      "image":"salada-frutas.jpg",
      "ingredients":[
         "2 bananas",
         "2 maçãs",
         "1 laranja",
         "1 xícara de morangos",
         "1 xícara de uvas",
         "1 xícara de kiwi",
         "1 xícara de abacaxi",
         "Suco de 1 limão",
         "Mel a gosto (opcional)"
      ],
      "prepareMode":"Modo de Preparo:\n1. Descasque as bananas, as maçãs e o kiwi. Corte todas as frutas em pedaços pequenos.\n2. Descasque a laranja e separe os gomos.\n3. Em uma tigela grande, coloque todas as frutas cortadas.\n4. Esprema o suco de limão sobre as frutas para evitar que oxidem e fiquem escuras.\n5. Misture delicadamente as frutas.\n6. Se desejar, adicione mel a gosto para adoçar a salada.\n7. Leve a salada à geladeira por pelo menos 1 hora antes de servir para que fique bem geladinha.\n8. Sirva a salada de frutas como sobremesa ou lanche refrescante.\n9. Aproveite essa opção saudável e saborosa!",
      "timingToCook":"15 minutos",
      "prepareLevel":"Fácil"
   },
   {
     "name": "Empadão de Frango",
     "type": "hot",
     "description": "Uma deliciosa torta salgada recheada com frango desfiado e temperado, coberta com uma massa crocante e dourada.",
     "image": "empadao_frango.jpg",
     "ingredients": [
       "2 xícaras de farinha de trigo",
       "1 colher de chá de sal",
       "1/2 xícara de manteiga gelada em cubos",
       "4 colheres de sopa de água gelada",
       "1 colher de sopa de azeite",
       "1 cebola picada",
       "2 dentes de alho picados",
       "2 xícaras de frango cozido e desfiado",
       "1/2 xícara de milho verde",
       "1/2 xícara de ervilha",
       "1 cenoura grande ralada",
       "1/2 xícara de molho de tomate",
       "1 colher de chá de páprica",
       "Sal e pimenta a gosto",
       "1 ovo batido para pincelar"
     ],
     "prepareMode": "Modo de Preparo:\n1. Em uma tigela, misture a farinha de trigo e o sal. Adicione a manteiga gelada e misture até obter uma textura de migalhas.\n2. Adicione a água gelada aos poucos, mexendo até a massa ficar homogênea. Forme uma bola, envolva em plástico filme e leve à geladeira por 30 minutos.\n3. Em uma panela, aqueça o azeite e refogue a cebola e o alho até ficarem dourados.\n4. Adicione o frango desfiado, o milho verde, a ervilha, a cenoura ralada, o molho de tomate, a páprica, o sal e a pimenta. Misture bem e cozinhe por alguns minutos.\n5. Pré-aqueça o forno a 200°C.\n6. Divida a massa em duas partes: uma para a base e outra para a cobertura.\n7. Abra metade da massa com um rolo e forre o fundo de uma forma de torta. Coloque o recheio de frango sobre a massa.\n8. Abra a outra metade da massa e cubra a torta. Feche as bordas e faça pequenos cortes na superfície para permitir a saída do vapor durante o cozimento.\n9. Pincele a superfície do empadão com o ovo batido.\n10. Leve ao forno preaquecido e asse por cerca de 40 minutos, ou até a massa ficar dourada.\n11. Retire do forno e deixe descansar por alguns minutos antes de servir.\n12. Corte em fatias e sirva quente.",
     "timingToCook": "1 hora e 20 minutos",
     "prepareLevel": "Intermediário"
   },
   {
     "name": "Quiche de Queijo e Espinafre",
     "type": "hot",
     "description": "Uma deliciosa torta salgada de origem francesa, recheada com queijo e espinafre, em uma massa crocante e saborosa.",
     "image": "quiche_queijo_espinafre.jpg",
     "ingredients": [
       "1 xícara de farinha de trigo",
       "1/2 colher de chá de sal",
       "1/2 xícara de manteiga gelada em cubos",
       "3 colheres de sopa de água gelada",
       "1 colher de sopa de azeite",
       "1 cebola picada",
       "2 dentes de alho picados",
       "200g de espinafre fresco",
       "200g de queijo gruyère ralado",
       "4 ovos",
       "1 xícara de creme de leite",
       "Sal e pimenta a gosto",
       "Noz-moscada ralada a gosto"
     ],
     "prepareMode": "Modo de Preparo:\n1. Em uma tigela, misture a farinha de trigo e o sal. Adicione a manteiga gelada e misture até obter uma textura de migalhas.\n2. Adicione a água gelada aos poucos, mexendo até a massa ficar homogênea. Forme uma bola, envolva em plástico filme e leve à geladeira por 30 minutos.\n3. Em uma frigideira, aqueça o azeite e refogue a cebola e o alho até ficarem dourados.\n4. Adicione o espinafre fresco e refogue até murchar. Retire do fogo e reserve.\n5. Pré-aqueça o forno a 180°C.\n6. Abra a massa com um rolo e forre o fundo de uma forma de quiche. Faça furos na massa com um garfo.\n7. Espalhe o queijo gruyère ralado sobre a massa.\n8. Em uma tigela, bata os ovos, o creme de leite, o sal, a pimenta e a noz-moscada.\n9. Despeje a mistura de ovos sobre o queijo e espinafre.\n10. Leve ao forno preaquecido e asse por cerca de 30-35 minutos, ou até a superfície ficar dourada e o recheio firme.\n11. Retire do forno e deixe esfriar um pouco antes de desenformar.\n12. Corte em fatias e sirva quente ou em temperatura ambiente.",
     "timingToCook": "1 hora",
     "prepareLevel": "Intermediário"
   }
]
